In [1]:
import pandas as pd
import numpy as np

In [14]:
df_random = pd.DataFrame(np.random.randint(1,30,size=(5,4)),
                   index = ['A', 'B', 'C', 'D', 'E'],
                   columns = 'W X Y Z'.split())
df_random

    W   X   Y   Z
A  27  10  13  15
B   1  25   9  14
C  16   8  13  19
D  19  12   3   9
E  25  18  25  29

In [15]:
df_random["X"]

A    10
B    25
C     8
D    12
E    18
Name: X, dtype: int32

In [16]:
df_random["Y"]

A    13
B     9
C    13
D     3
E    25
Name: Y, dtype: int32

In [17]:
df_random["X"] * df_random["Y"]

A    130
B    225
C    104
D     36
E    450
dtype: int32

In [18]:
df_random["X"] + df_random["Y"] ** 2

A    179
B    106
C    177
D     21
E    643
dtype: int32

In [20]:
df_random["Result"] = df_random["W"]*df_random["X"] + df_random["Y"]**2 - df_random["Z"].mean() + 100  
df_random

    W   X   Y   Z  Result
A  27  10  13  15   521.8
B   1  25   9  14   188.8
C  16   8  13  19   379.8
D  19  12   3   9   319.8
E  25  18  25  29  1157.8

In [2]:
df = pd.DataFrame({'var1': ['10','23','33','22','11','40'],
                   'var2': ['25','8','20','6','30','5']})
df

  var1 var2
0   10   25
1   23    8
2   33   20
3   22    6
4   11   30
5   40    5

In [9]:
df.iloc[0,1] * df.iloc[5,0]

TypeError: can't multiply sequence by non-int of type 'str'

In [10]:
eval(df.iloc[0,1]) * eval(df.iloc[5,0])

1000

In [11]:
eval("np.sqrt(8)")

2.8284271247461903